{"backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["output_font", 0, 0], ["output_char", 0, 0], ["output_bold", 0, 0], ["output_italics", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 1], "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 16, "use_bias": true, "padding": "same", "activity_regularizer": null, "name": "conv2d_1", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 16, "use_bias": true, "padding": "same", "activity_regularizer": null, "name": "conv2d_2", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [16, 256]}, "name": "reshape_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense1", "activation": "relu", "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "dense1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"dropout": 0.0, "implementation": 1, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "trainable": true, "stateful": false, "unroll": false, "return_sequences": true, "bias_constraint": null, "name": "gru1", "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "reset_after": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "gru1", "inbound_nodes": [[["dense1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"dropout": 0.0, "implementation": 1, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": true, "recurrent_regularizer": null, "recurrent_constraint": null, "trainable": true, "stateful": false, "unroll": false, "return_sequences": true, "bias_constraint": null, "name": "gru1_b", "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "reset_after": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "gru1_b", "inbound_nodes": [[["dense1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["gru1", 0, 0, {}], ["gru1_b", 0, 0, {}]]], "class_name": "Add"}, {"config": {"dropout": 0.0, "implementation": 1, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "trainable": true, "stateful": false, "unroll": false, "return_sequences": true, "bias_constraint": null, "name": "gru2", "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "reset_after": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "gru2", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"dropout": 0.0, "implementation": 1, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": true, "recurrent_regularizer": null, "recurrent_constraint": null, "trainable": true, "stateful": false, "unroll": false, "return_sequences": true, "bias_constraint": null, "name": "gru2_b", "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "reset_after": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "gru2_b", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["gru2", 0, 0, {}], ["gru2_b", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense2", "activation": "linear", "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "dense2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["dense2", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "output_font", "activation": "softmax", "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "output_font", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "output_char", "activation": "softmax", "units": 94, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "output_char", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "output_bold", "activation": "softmax", "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "output_bold", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "output_italics", "activation": "softmax", "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null}, "name": "output_italics", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model", "keras_version": "2.2.0"}