__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 64, 64, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 16)   160         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 16)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 16, 16, 16)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 16, 256)      0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 16, 32)       8224        reshape_1[0][0]                  
__________________________________________________________________________________________________
gru1 (GRU)                      (None, 16, 512)      837120      dense1[0][0]                     
__________________________________________________________________________________________________
gru1_b (GRU)                    (None, 16, 512)      837120      dense1[0][0]                     
__________________________________________________________________________________________________
add_1 (Add)                     (None, 16, 512)      0           gru1[0][0]                       
                                                                 gru1_b[0][0]                     
__________________________________________________________________________________________________
gru2 (GRU)                      (None, 16, 512)      1574400     add_1[0][0]                      
__________________________________________________________________________________________________
gru2_b (GRU)                    (None, 16, 512)      1574400     add_1[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 1024)     0           gru2[0][0]                       
                                                                 gru2_b[0][0]                     
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 16, 64)       65600       concatenate_1[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1024)         0           dense2[0][0]                     
__________________________________________________________________________________________________
output_font (Dense)             (None, 11)           11275       flatten_1[0][0]                  
__________________________________________________________________________________________________
output_char (Dense)             (None, 94)           96350       flatten_1[0][0]                  
__________________________________________________________________________________________________
output_bold (Dense)             (None, 2)            2050        flatten_1[0][0]                  
__________________________________________________________________________________________________
output_italics (Dense)          (None, 2)            2050        flatten_1[0][0]                  
==================================================================================================
Total params: 5,011,069
Trainable params: 5,011,069
Non-trainable params: 0
__________________________________________________________________________________________________
